WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_adc.c
  dma_initialize();

  adc_enable();

  // Enable ADC interrupt handler
  up_enable_irq(STM32_IRQ_ADC);

  // ADC WITH DMA won't start until adc_start() is called
  _meadowAdcInit = true;

  // We need to read the following before we can calculate any results.
  // Note: this doesn't use DMA, instead it uses the injected mode.
  ret = meadow_adc_read_injection_temp_vref(&adcTempReading, &adcVrefInCal);
  if(ret < 0)
  {
    syslog(LOG_ERR, "Temperature/Cal Ref Conversion Error. ret:%d\n");
    return ret;
  }

  // Set the global calibration value as this will be used later
  _doubVrefInCal = (double)adcVrefInCal;

  return OK;
}

/************************************************************************************
 * Public Functions
 ************************************************************************************/
// This function can handle as few as 1 GPIO with 1 buffer element and as many
// as 16 GPIOs with a buffer with space for all 16.
int meadow_adc_configure(uint8_t gpioList[], uint32_t gpioCount,
          double *voltageResultBuf, uint32_t voltBufSzBytes)
{
#if defined CONFIG_ADC_TESTS
  syslog(1, "meadow_adc_configure() gpioCount:%lu, voltBufSzBytes:%lu, voltageResultBuf:%p\n",
            gpioCount, voltBufSzBytes, voltageResultBuf);
#endif

  // Check for valid and reasonable input parameters
  uint32_t gpioListOff;
  uint32_t mapOff = 0;
  uint32_t userBufElements;

  if(_meadowAdcInit)
  {
    syslog(LOG_ERR, "%s@%d-Error:There is already an active ADC configuration.\n",
              __FILE__, __LINE__);
    return -EPERM;    // Operation not permitted
  }

  if(voltageResultBuf == NULL)
  {
    syslog(1, "%s@%d-Error:voltageResultBuf is NULL\n",
              __FILE__, __LINE__, voltBufSzBytes);
    return -EINVAL;   // Invalid argument
  }
  
  // Data elements are 2 bytes, therefore, size must be even number
  if(voltBufSzBytes % 2)
  {
    syslog(1, "%s@%d-Error:ADC values are always 16-bits and voltBufSzBytes is not even (%lu)\n",
              __FILE__, __LINE__, voltBufSzBytes);
    return -EINVAL;   // Invalid argument
  }

  // Each element is 2 bytes
  userBufElements = voltBufSzBytes/2;

  // Must have at least 1 entry per gpio
  if(gpioCount < userBufElements)
  {
    syslog(1, "%s@%d-Error:gpioCount:%lu < userBufElements:%lu\n",
              __FILE__, __LINE__, gpioCount, userBufElements);
    return -EINVAL;   // Invalid argument
  }

  // Verify GPIO list is valid
  for(gpioListOff = 0; gpioListOff < gpioCount; gpioListOff++)
  {
    // Look for matching port/pin in the list
    for(mapOff = 0; mapOff < MEADOW_ADC_GPIO_CHAN_MAP_LENGTH; mapOff++)
    {
      if(gpioList[gpioListOff] == _gpioAdcChanMap[mapOff])
        break;   // Found-it's connected to the ADC
    }

    // Did we go through the entire list and not find a match?
    if(mapOff == MEADOW_ADC_GPIO_CHAN_MAP_LENGTH)
    {
      syslog(LOG_INFO, "GPIO:0x%02x (P%c%d) not connected to ADC\n", gpioList[gpioListOff],
                  (gpioList[gpioListOff] >> 4) + 'A', gpioList[gpioListOff] & 0x0f);
      return -EINVAL;   // Invalid argument
    }
  }

  // Will the number of GPIOs exactly fill the provided buffer?
  if(gpioCount % userBufElements != 0)
  {
    // Don't allow empty buffer slots as it's likely the user made an unintended error.
    syslog(1, "%s@%d-Error:buffer size and the number of GPIOs not multiple.\n",
                __FILE__, __LINE__);
    return -EINVAL;   // Invalid argument
  }

  // Populate global values
  _gpioList = gpioList;
  _gpioTransferCount = gpioCount;
  _voltageResultBuf = voltageResultBuf;
  _voltBufSzBytes = voltBufSzBytes;

  // Signaling semaphore
  sem_init(&_waitTillDoneSem, 0, 0);
  sem_setprotocol(&_waitTillDoneSem, SEM_PRIO_NONE);  

  // Do before configuration
  // DON'T FREE the buffer's address as it's part of the DMA configuration
  _dmaAdcBuf = kmm_malloc(_voltBufSzBytes);
  if(_dmaAdcBuf == NULL)
  {
    syslog(LOG_ERR, "%s@%d-Error:Buffer space not available\n",
                __FILE__, __LINE__);
    return -ENOMEM;   // Out of memory
  }

  meadow_adc_initialize_dma();

  #if defined CONFIG_ADC_TESTS
  adc_test_display_basic_adc_regs(STM32_ADC1_BASE);
  adc_test_display_basic_dma_regs();
  #endif

  return OK;
}

//=========================================================
// Calling this function will free all the allocations and configurations
// that the current active configuration has changed.
int meadow_adc_unconfigure_active_config()
{
  uint32_t regval;
  
  if(! _meadowAdcInit)
  {
    syslog(LOG_ERR, "%s@%d-Error:There is no active ADC configuration.\n",
              __FILE__, __LINE__);
    return -EPERM;    // Operation not permitted
  }

  // Reverse previous configuration

  // Turn off ADC
  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);
  regval &= ~ADC_CR2_ADON;
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);

  // Stop DMA
  regval  = getreg32(STM32_DMA2_S0CR);
  regval &= ~DMA_SCR_EN;
  putreg32(regval, STM32_DMA2_S0CR);

  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_CR1_OFFSET);
  regval &= ~ADC_CR1_SCAN;           // 1=Scan mode (Scans channels in ADC_SQRx registers)
  regval &= ~ADC_CR1_EOCIE;          // 1=Enable ADC interrupt for EOC (not with DMA)
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_CR1_OFFSET);

  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);
  regval &= ~ADC_CR2_DMA;          // 0=Disable DMA
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);

  regval = getreg32(STM32_ADC1_SQR1);
  regval &= ADC_SQR1_RESERVED;   // Clear all SQR Bits
  putreg32(regval, STM32_ADC1_SQR1);

  regval = getreg32(STM32_ADC1_SQR2);
  regval &= ADC_SQR2_RESERVED;   // Clear all SQR Bits
  putreg32(regval, STM32_ADC1_SQR2);

  regval = getreg32(STM32_ADC1_SQR3);
  regval &= ADC_SQR3_RESERVED;   // Clear all SQR Bits
  putreg32(regval, STM32_ADC1_SQR3);

