WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_adc.c
  regval = getreg32(STM32_ADC_CCR);
  regval &= ~ADC_CCR_TSVREFE;       // 0=disable temperature sensor channel
  regval &= ~ADC_CCR_VBATE;         // 0=disable vbat channel
  regval &= ~ADC_CCR_ADCPRE_MASK;   // Clear any bits in ADC prescaler
  regval &= ~ADC_CCR_DMA_MASK;      // Clear any bits in DMA mode (multi-ADC mode only) 
  regval &= ~ADC_CCR_DELAY_MASK;    // 0000=5*Tadcclk (only used for dual/triple)
  regval &= ~ADC_CCR_MULTI_MASK;    // Clear any bits
  regval |= ADC_CCR_MULTI_NONE;     // 00000=Independent mode
  putreg32(regval, STM32_ADC_CCR);

  // The active configuration must have an active DMA handle from the Nuttx
  // DMA configuration call.
  if(_dmaHandle != NULL)
  {
    stm32_dmastop(_dmaHandle);
    stm32_dmafree(_dmaHandle); 
  }
  _dmaHandle = NULL;

  if(_dmaAdcBuf != NULL)
  {
    free(_dmaAdcBuf);
  }

  _meadowAdcInit = false;
  return OK;
}

//=========================================================
// This public function will return the values for Vbat and Vtemp from the
// internal STM32F7 chip. The internal sersors have calibration values written
// into the chip at the time of manufacturing. This function will use these
// values to provide the most accurate possible information to the caller.
//
// Quote from Ref Man 15.10
// "The temperature sensor output voltage changes linearly with temperature.
// The offset of this linear function depends on each chip due to process
// variation (up to 45°C from one chip to another).
// The internal temperature sensor is more suited for applications that detect
// temperature variations instead of absolute temperatures. If accurate
// temperature reading is required, an external temperature sensor should be
// used"
int meadow_adc_read_temp_vbat(double *batteryVoltage,
          double *temperatureValue)
{
  int ret;
  uint16_t adcTempReading;
  uint16_t adcBatteryReading;
  uint16_t adcVrefInCal;

  if(! _meadowAdcInit)
  {
    syslog(LOG_ERR, "%s@%d-Error:There is no active ADC configuration.\n",
              __FILE__, __LINE__);
    return -EPERM;    // Operation not permitted
  }

  // This call must be first because it reads the internal reference value
  // too, which is needed to derived the most accurate values
  ret = meadow_adc_read_injection_temp_vref(&adcTempReading, &adcVrefInCal);
  if(ret < 0)
  {
    syslog(LOG_ERR, "Temperature Conversion Error. ret:%d\n", ret);
    return ret;
  }

  // From data sheet, temperatures calibration values were read at 30 and
  // 110 degrees celsius. 
  double calAtDegC30_t1  = 30.0;     // Calibration temperature 1 in DegC
  double calAtDegC110_t2 = 110.0;    // Calibration temperature 2 in DegC
  // Get the STM factory calibration values
  double calRefVal_CAL  = (double) getreg16(MEADOW_ADC_VREFINT_CAL_ADDR);
  double tempCal1_TEMP1 = (double) getreg16(MEADOW_ADC_TEMPSENSOR_CAL30_ADDR);
  double tempCal2_TEMP2 = (double) getreg16(MEADOW_ADC_TEMPSENSOR_CAL110_ADDR);

  // The adc temperature measurement value (0-4095) needs to be processed.
  // The following equation came from http://efton.sk/STM32/STM32_VREF.pdf.
  *temperatureValue = calAtDegC30_t1 + (calAtDegC110_t2 - calAtDegC30_t1) * \
            ((double)adcTempReading * calRefVal_CAL - \
            tempCal1_TEMP1 * (double)adcVrefInCal) / \
            ((double)adcVrefInCal * (tempCal2_TEMP2 - tempCal1_TEMP1));

  syslog(1, "Temperature:%03f, ADC output:%u\n", *temperatureValue, adcTempReading);

  // Now do the same for the battery voltage and internal CAL reference
  ret = meadow_adc_read_internal_vbat(&adcBatteryReading);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%04d-Vbat Conversion Error. ret:%d\n", ret);
    return ret;
  }

  // Re-establish the Calibration reference if its drifted
  if(_doubVrefInCal != (double)adcVrefInCal)
    _doubVrefInCal = (double)adcVrefInCal;

  // Convert the reading into a voltage value
  ret = meadow_adc_convert_adc_to_voltage(adcBatteryReading, batteryVoltage);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%04d-Conversion Cleanup Error. ret:%d\n", ret);
    return ret;
  }

  return OK;
}

//=========================================================
// To get the most best result we'll use the following calculation taken
// from http://efton.sk/STM32/STM32_VREF.pdf.
int meadow_adc_convert_adc_to_voltage(uint16_t adcValue, double *convertedVoltage)
{
  double calRefVal_CAL  = (double) getreg16(MEADOW_ADC_VREFINT_CAL_ADDR);
  double voltage = (MEADOW_ADC_VOLTAGE_ADC_CAL_TAKEN * (double)adcValue * calRefVal_CAL + \
      (_doubVrefInCal * MEADOW_ADC_MAX_ADC_COUNT_DOUBLE / 2.0)) / \
      (_doubVrefInCal * MEADOW_ADC_MAX_ADC_COUNT_DOUBLE);

  // Don't know the cause but, the voltage returned is exactly 0.50 volts
  // too high, from 0 - 3.3.
  *convertedVoltage = voltage - 0.50;

  // syslog(1, "--++>> value (adc):%04u, voltage:%.3f\n", adcValue, *convertedVoltage);
  return OK;
}

//=========================================================
// Calling this function will initiate the ADC converstion process. It will
// run until the configured buffer is full. When the buffer is full (or error)
// the calling thread will return to the caller, signifing that the buffer
// is ready for inspection.
int meadow_adc_read_conversions(void)
{
  if(! _meadowAdcInit)
  {
    syslog(LOG_ERR, "%s@%d-Error:Meadow ADC not initialized.\n",
              __FILE__, __LINE__);
    return -EPERM;    // Operation not permitted
  }

  // Since not doing continous conversion we need to start ADC each time
  adc_start();

  // Wait for conversion to finish for valid data
  meadow_adc_buffer_takesem(&_waitTillDoneSem);

  // The following is used to determine if the output truely follows the analog
  // input as it switches above and below mid-point of Vdd.
#if MEADOW_ADC_TEST_TOGGLE_ADC_INPUT > 0
  // Note to execute the following display adds about 26 ms
  // Show data before copy
  static int callCount = 0;
  static int previousNoChg = 0;
  callCount++;
  if(previousNoChg != _noChangeCnt)
  {
    syslog(LOG_ERR, "%04d-Error Count:%05d\n", callCount, _noChangeCnt - 1);
  }
  previousNoChg = _noChangeCnt;
#endif

  // ADC conversion must have completed. Now convert the collected data
  // to voltage and copy to the user's buffer.
  for(int val = 0; val < _gpioTransferCount; val++)
  {
    int ret;
    double convVoltage;

    // _dmaAdcBuf contain the adc output (0-4095) placed there by DMA.
    //  the analog input via DMA
    ret = meadow_adc_convert_adc_to_voltage(_dmaAdcBuf[val], &convVoltage);
    if(ret < 0)
    {
      syslog(LOG_ERR, "%04d-Conversion Cleanup Error. ret:%d\n", ret);
      return ret;
    }
    _voltageResultBuf[val] = convVoltage;
  }

  return OK;
}
